In [303]:
import numpy as np 
import pandas as pd
import mysql.connector

import re

from sklearn.preprocessing import StandardScaler, LabelEncoder, OneHotEncoder, LabelBinarizer, Imputer
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import f1_score


%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Overview
The data has been split into two groups:

* training set (train.csv)
* test set (test.csv)
* The training set should be used to build your machine learning models. For the training set, we provide the outcome (also known as the “ground truth”) for each passenger. Your model will be based on “features” like passengers’ gender and class. You can also use feature engineering to create new features.

* The test set should be used to see how well your model performs on unseen data. For the test set, we do not provide the ground truth for each passenger. It is your job to predict these outcomes. For each passenger in the test set, use the model you trained to predict whether or not they survived the sinking of the Titanic.

* We also include gender_submission.csv, a set of predictions that assume all and only female passengers survive, as an example of what a submission file should look like

| Variable | Definition | Key |
| ------ | ------ | ------ |
| survival | Survival | 0 = No, 1 = Yes |
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|sex|Sex||
|Age|Age in years||
|sibsp|# of siblings / spouses aboard the Titanic||
|parch|# of parents / children aboard the Titanic||
|ticket|Ticket numbe|
|fare|Passenger fare|
|cabin|Cabin numbe|
|embarke|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|

* Variable Notes
pclass: A proxy for socio-economic status (SES)
1st = Upper
2nd = Middle
3rd = Lower

* age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

* sibsp: The dataset defines family relations in this way...
Sibling = brother, sister, stepbrother, stepsister
Spouse = husband, wife (mistresses and fiancés were ignored)

* parch: The dataset defines family relations in this way...
Parent = mother, father
Child = daughter, son, stepdaughter, stepson
Some children travelled only with a nanny, therefore parch=0 for them.

In [304]:
%sql mysql+mysqldb://jwallis:zDxZz4dejpiNhx8F@Mafdet/titanic

In [305]:
%%sql
SELECT * from test LIMIT 10;

 * mysql+mysqldb://jwallis:***@Mafdet/titanic
10 rows affected.

[(893, 3, 'Wilkes, Mrs. James (Ellen Needs)', 'female', 47.0, 1, 0, '363272', 7.0, '', 'S'),
 (894, 2, 'Myles, Mr. Thomas Francis', 'male', 62.0, 0, 0, '240276', 9.6875, '', 'Q'),
 (895, 3, 'Wirz, Mr. Albert', 'male', 27.0, 0, 0, '315154', 8.6625, '', 'S'),
 (896, 3, 'Hirvonen, Mrs. Alexander (Helga E Lindqvist)', 'female', 22.0, 1, 1, '3101298', 12.2875, '', 'S'),
 (897, 3, 'Svensson, Mr. Johan Cervin', 'male', 14.0, 0, 0, '7538', 9.225, '', 'S'),
 (898, 3, 'Connolly, Miss. Kate', 'female', 30.0, 0, 0, '330972', 7.6292, '', 'Q'),
 (899, 2, 'Caldwell, Mr. Albert Francis', 'male', 26.0, 1, 1, '248738', 29.0, '', 'S'),
 (900, 3, 'Abrahim, Mrs. Joseph (Sophie Halaut Easu)', 'female', 18.0, 0, 0, '2657', 7.2292, '', 'C'),
 (901, 3, 'Davies, Mr. John Samuel', 'male', 21.0, 2, 0, 'A/4 48871', 24.15, '', 'S'),
 (902, 3, 'Ilieff, Mr. Ylio', 'male', None, 0, 0, '349220', 7.8958, '', 'S')]

In [306]:
%%sql
ALTER TABLE test MODIFY Embarked CHAR(1) NULL;
ALTER TABLE train MODIFY Embarked CHAR(1) NULL;

 * mysql+mysqldb://jwallis:***@Mafdet/titanic
0 rows affected.
0 rows affected.

[]

In [307]:
%%sql
#test_cursor = cnx.cursor(buffered = True)
UPDATE test 
SET NAME = REPLACE(NAME, '"', '');

UPDATE test 
SET EMBARKED = NULL
WHERE EMBARKED = '\r';

UPDATE train
SET NAME = REPLACE(NAME, '"', '');

UPDATE train 
SET EMBARKED = NULL
WHERE EMBARKED = '\r';

 * mysql+mysqldb://jwallis:***@Mafdet/titanic
417 rows affected.
0 rows affected.
891 rows affected.
0 rows affected.

[]

In [308]:
cnx = mysql.connector.connect(user = 'jwallis', password = "zDxZz4dejpiNhx8F", host = "Mafdet", database = 'titanic')
#test = pd.read_sql_query("SELECT * from test", cnx)
test = pd.read_sql("SELECT * from test", cnx)
train = pd.read_sql_query("SELECT * from train", cnx)
gender_submission = pd.read_sql_query("SELECT * from gender_submission", cnx)
cnx.close()

#test["Name"] = [x.strip('"') for x in test["Name"].tolist()]
#train["Name"] = [x.strip('"') for x in train["Name"].tolist()]
print (test.dtypes)
train.head()

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,,S

In [309]:
test[["Surname", "Title", "Forename"]] = test["Name"].str.split(r'[.,]', 2, expand = True)
train[["Surname", "Title", "Forename"]] = train["Name"].str.split(r'[.,]', 2, expand = True)
#ex = train["Name"].str.split(r'[.,]', expand = True)
#print (test["Surname"].value_counts())
#test[["title", "split"]] = test["split"].str.split('.', expand = True)
#ex = test["Name"].str.extractall()
#print (ex[3].value_counts())
#ex.where(ex[3] == " Barrett)").dropna()
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Title,Forename
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,,S,Braund,Mr,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs,John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,,S,Heikkinen,Miss,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,,S,Allen,Mr,William Henry

In [310]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Title,Forename
0,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,,S,Wilkes,Mrs,James (Ellen Needs)
1,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,,Q,Myles,Mr,Thomas Francis
2,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,,S,Wirz,Mr,Albert
3,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,,S,Hirvonen,Mrs,Alexander (Helga E Lindqvist)
4,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,,S,Svensson,Mr,Johan Cervin

In [311]:
#train.set_index("PassengerId", inplace = True)
train["Cabin"].replace(to_replace = "", value = np.nan, inplace = True)
test["Cabin"].replace(to_replace = "", value = np.nan, inplace = True)
print (train["Cabin"].unique())
train.head()

[nan 'C85' 'C123' 'E46' 'G6' 'C103' 'D56' 'A6' 'C23 C25 C27' 'B78' 'D33'
 'B30' 'C52' 'B28' 'C83' 'F33' 'F G73' 'E31' 'A5' 'D10 D12' 'D26' 'C110'
 'B58 B60' 'E101' 'F E69' 'D47' 'B86' 'F2' 'C2' 'E33' 'B19' 'A7' 'C49'
 'F4' 'A32' 'B4' 'B80' 'A31' 'D36' 'D15' 'C93' 'C78' 'D35' 'C87' 'B77'
 'E67' 'B94' 'C125' 'C99' 'C118' 'D7' 'A19' 'B49' 'D' 'C22 C26' 'C106'
 'C65' 'E36' 'C54' 'B57 B59 B63 B66' 'C7' 'E34' 'C32' 'B18' 'C124' 'C91'
 'E40' 'T' 'C128' 'D37' 'B35' 'E50' 'C82' 'B96 B98' 'E10' 'E44' 'A34'
 'C104' 'C111' 'C92' 'E38' 'D21' 'E12' 'E63' 'A14' 'B37' 'C30' 'D20' 'B79'
 'E25' 'D46' 'B73' 'C95' 'B38' 'B39' 'B22' 'C86' 'C70' 'A16' 'C101' 'C68'
 'A10' 'E68' 'B41' 'A20' 'D19' 'D50' 'D9' 'A23' 'B50' 'A26' 'D48' 'E58'
 'C126' 'B71' 'B51 B53 B55' 'D49' 'B5' 'B20' 'F G63' 'C62 C64' 'E24' 'C90'
 'C45' 'E8' 'B101' 'D45' 'C46' 'D30' 'E121' 'D11' 'E77' 'F38' 'B3' 'D6'
 'B82 B84' 'D17' 'A36' 'B102' 'B69' 'E49' 'C47' 'D28' 'E17' 'A24' 'C50'
 'B42' 'C148']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Title,Forename
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs,John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr,William Henry

In [312]:
gender_submission.head()

   PassengerId Survived
0          892        0
1          893        1
2          894        0
3          895        0
4          896        1

Thoughts:
* Is logistic regression appropriate here - I am looking for a binary outcome, many of my input features will be discrete, or "labels" rather than continuous variables
* If I use logistic regression, do I need to render, e.g. sex, into a value (i.e. 1/0)

Feature engineering
* Separating out singles/parents/children/children with nannies
* Separating out cabin to indicate deck --> possible correlation with socioeconomic class/fare
* worth reviewing titles (particularly for females) for correlation with Parch etc? Identifying children/singles/nannies

In [313]:
def alpha(entry):
    if entry is not np.nan:
        y = [x for x in entry if x.isalpha() == True][0]
    else:
        y = np.nan
    return y

alpha("A67")

#for a in list(train["Cabin"].unique()):
#    print (a)
#    print (alpha(a))

'A'

In [314]:
train["Cabin Level"] = train["Cabin"].apply(alpha)
test["Cabin Level"] = test["Cabin"].apply(alpha)
X_train = train[["Pclass", "Age", "SibSp"]].copy()
X_test = test[["Pclass", "Age", "SibSp"]].copy()
y_train = train["Survived"].copy()
y_test = gender_submission.copy()
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Title,Forename,Cabin Level
0,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Wilkes,Mrs,James (Ellen Needs),NaN
1,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Myles,Mr,Thomas Francis,NaN
2,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Wirz,Mr,Albert,NaN
3,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Hirvonen,Mrs,Alexander (Helga E Lindqvist),NaN
4,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S,Svensson,Mr,Johan Cervin,NaN

In [316]:
print (train["Cabin Level"].unique())
print (train["Embarked"].unique())
#train.where(train["Embarked"] == "\r").dropna() #practise writing to SQL database from here

[nan 'C' 'E' 'G' 'D' 'A' 'B' 'F' 'T']
['S' 'C' 'Q' None]

In [296]:
print (np.shape(np.array(train.loc[:, "Embarked"])))
a = np.array(train.loc[:, "Embarked"]).reshape(-1, 1)#[0:10]
print (np.shape(train))
#(x.loc[:, "Embarked"])

(891,)
(891, 16)

## Dealing with null values for label encoding

In [318]:
print (train["Embarked"].isna().sum())
print (train["Embarked"].notna().sum())

print (test["Embarked"].isna().sum())
print (test["Embarked"].notna().sum())

#train["Embarked"].value_counts().index[0]
print (train["Cabin Level"].isna().sum())
print (train["Cabin Level"].notna().sum())
print (len(train["Cabin Level"]))
train["Cabin Level"].value_counts()
train["Embarked"].value_counts()

2
889
0
417
687
204
891

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [319]:
# fill nans with string values that will be encoded

#train["Sex"].fillna("NAN", inplace = True)
#print 
#train["Embarked"].fillna("NAN", inplace = True)

train["Cabin Level"].fillna("NAN", inplace = True)
test["Cabin Level"].fillna("NAN", inplace = True)
# alternative approaches - fill with most frequently occurring value
# this doesn't work for the cabin level (majority of fields are null)
# for numerical values there is the sklearn imputer function - allows median
train["Embarked"] = train["Embarked"].fillna(train["Embarked"].value_counts().index[0])

#... how do the ML training models handle nan values? how doe

In [326]:
sex_encoder = LabelBinarizer() #LabelEncoder()
X_train["SexCat"] = sex_encoder.fit_transform(train.loc[:,"Sex"])
X_test["SexCat"] = sex_encoder.transform(test.loc[:,"Sex"])
#print (sex_encoder.classes_)
sex_codes = pd.DataFrame(index = train["Sex"].unique(), data = sex_encoder.transform(train["Sex"].unique()), columns = ["Code"])
#df["code"] = 
#print (df)

embark_encoder = LabelEncoder()
X_train["Embarked"] = embark_encoder.fit_transform(train.loc[:,"Embarked"])
embark_encoder1hot = OneHotEncoder() #
embarked_1hot = embark_encoder1hot.fit_transform(np.array(X_train.loc[:, "Embarked"]).reshape(-1, 1)) #output is scipy sparse matrix
embarked_codes = pd.DataFrame(index = train["Embarked"].unique(), data = embark_encoder.transform(train["Embarked"].unique()), columns = ["Code 1"])
embarked_codes = pd.DataFrame(index = train["Embarked"].unique(), data = embarked_1hot.transform(np.array(X_train.loc[:, "Embarked"]).reshape(-1, 1))

print (embark_encoder.classes_)

#cabin_encoder = LabelEncoder()
#x["Cabin Level"] = cabin_encoder.fit_transform(train.loc[:,"Cabin Level"])
#print (cabin_encoder.classes_)



#x.head()
sex_codes.head()
print (np.shape(embarked_1hot))
embarked_1hot.toarray()
embarked_codes.head()

SyntaxError: invalid syntax (<ipython-input-326-f12d368cf553>, line 16)

In [15]:
for column in x.columns:
    print (str(column))
    print (x[column].unique())

Pclass
[3 1 2]
Age
[22.   38.   26.   35.     nan 54.    2.   27.   14.    4.   58.   20.
 39.   55.   31.   34.   15.   28.    8.   19.   40.   66.   42.   21.
 18.    3.    7.   49.   29.   65.   28.5   5.   11.   45.   17.   32.
 16.   25.    0.83 30.   33.   23.   24.   46.   59.   71.   37.   47.
 14.5  70.5  32.5  12.    9.   36.5  51.   55.5  40.5  44.    1.   61.
 56.   50.   36.   45.5  20.5  62.   41.   52.   63.   23.5   0.92 43.
 60.   10.   64.   13.   48.    0.75 53.   57.   80.   70.   24.5   6.
  0.67 30.5   0.42 34.5  74.  ]
SibSp
[1 0 3 4 2 5 8]
SexCat
[1 0]
Embarked
[3 1 2 0]

In [102]:
%sql mysql+mysqldb://jwallis:zDxZz4dejpiNhx8F@Mafdet/titanic

In [103]:
%%sql
SELECT * from test LIMIT 10;

 * mysql+mysqldb://jwallis:***@Mafdet/titanic
10 rows affected.

[(893, 3, '"Wilkes, Mrs. James (Ellen Needs)"', 'female', 47.0, 1, 0, '363272', 7.0, '', 'S'),
 (894, 2, '"Myles, Mr. Thomas Francis"', 'male', 62.0, 0, 0, '240276', 9.6875, '', 'Q'),
 (895, 3, '"Wirz, Mr. Albert"', 'male', 27.0, 0, 0, '315154', 8.6625, '', 'S'),
 (896, 3, '"Hirvonen, Mrs. Alexander (Helga E Lindqvist)"', 'female', 22.0, 1, 1, '3101298', 12.2875, '', 'S'),
 (897, 3, '"Svensson, Mr. Johan Cervin"', 'male', 14.0, 0, 0, '7538', 9.225, '', 'S'),
 (898, 3, '"Connolly, Miss. Kate"', 'female', 30.0, 0, 0, '330972', 7.6292, '', 'Q'),
 (899, 2, '"Caldwell, Mr. Albert Francis"', 'male', 26.0, 1, 1, '248738', 29.0, '', 'S'),
 (900, 3, '"Abrahim, Mrs. Joseph (Sophie Halaut Easu)"', 'female', 18.0, 0, 0, '2657', 7.2292, '', 'C'),
 (901, 3, '"Davies, Mr. John Samuel"', 'male', 21.0, 2, 0, 'A/4 48871', 24.15, '', 'S'),
 (902, 3, '"Ilieff, Mr. Ylio"', 'male', None, 0, 0, '349220', 7.8958, '', 'S')]

In [118]:

SELECT * from test LIMIT 10
#test_cursor.exec

 * mysql+mysqldb://jwallis:***@Mafdet/titanic
417 rows affected.
0 rows affected.
10 rows affected.

[(893, 3, 'Wilkes, Mrs. James (Ellen Needs)', 'female', 47.0, 1, 0, '363272', 7.0, '', 'S'),
 (894, 2, 'Myles, Mr. Thomas Francis', 'male', 62.0, 0, 0, '240276', 9.6875, '', 'Q'),
 (895, 3, 'Wirz, Mr. Albert', 'male', 27.0, 0, 0, '315154', 8.6625, '', 'S'),
 (896, 3, 'Hirvonen, Mrs. Alexander (Helga E Lindqvist)', 'female', 22.0, 1, 1, '3101298', 12.2875, '', 'S'),
 (897, 3, 'Svensson, Mr. Johan Cervin', 'male', 14.0, 0, 0, '7538', 9.225, '', 'S'),
 (898, 3, 'Connolly, Miss. Kate', 'female', 30.0, 0, 0, '330972', 7.6292, '', 'Q'),
 (899, 2, 'Caldwell, Mr. Albert Francis', 'male', 26.0, 1, 1, '248738', 29.0, '', 'S'),
 (900, 3, 'Abrahim, Mrs. Joseph (Sophie Halaut Easu)', 'female', 18.0, 0, 0, '2657', 7.2292, '', 'C'),
 (901, 3, 'Davies, Mr. John Samuel', 'male', 21.0, 2, 0, 'A/4 48871', 24.15, '', 'S'),
 (902, 3, 'Ilieff, Mr. Ylio', 'male', None, 0, 0, '349220', 7.8958, '', 'S')]

In [22]:
%%sql
show tables

 * mysql+mysqldb://jwallis:***@Mafdet/titanic
3 rows affected.

[('gender_submission',), ('test',), ('train',)]

In [23]:
%%sql
desc gender_submission

 * mysql+mysqldb://jwallis:***@Mafdet/titanic
2 rows affected.

[('PassengerId', 'int(4)', 'NO', 'PRI', None, ''),
 ('Survived', 'binary(1)', 'NO', '', None, '')]